# IsBanned Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstancePlacingArgs..::..IsBanned Property
FamilyInstancePlacingArgs Class See Also
---
Indicates if the cursor is banned or not.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsBanned { get; set; }
```

Visual Basic
---
```text
Public Property IsBanned As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsBanned {
	bool get ();
	void set (bool value);
}
```

# See Also
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace